app/controllers/cards_controller.rb

  def index
    @cards = Card.all.paginate( :page => params[:page] )
---
SELECT  "cards".* FROM "cards" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "cards"

  def create
    @card = Card.new(card_params)

    respond_to do |format|
      if @card.save
---
INSERT INTO "cards" ("CardNumber", "RealName", "Gender", "Birthday", "Occupation", "TypeOfCard", "EgoBalance", "MobileNumber", "email", "Issued", "LastBuy", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def set_card
      @card = Card.find(params[:id])
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]