app/controllers/csv_files_controller.rb

    def set_csv_file
      session[:file_id] = CsvFile.create.id if CsvFile.find_by(id: session[:file_id]).nil?
---
INSERT INTO "csv_files" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2017-02-07 19:55:34 UTC], ["updated_at", 2017-02-07 19:55:34 UTC]]
SELECT  "csv_files".* FROM "csv_files" WHERE "csv_files"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]